from aiogram import F, Router
from aiogram.filters import Command, CommandStart
from aiogram.types import CallbackQuery, Message

from bot.keyboards import back_keyboard, info_menu, main_menu


router = Router()


WELCOME_TEXT = (
    "<b>🎭 Вітаємо в Ріжці!</b>\n\n"
    "Ріжця — це рольова гра, де ти можеш "
    "створити власну історію, познайомитися "
    "з іншими гравцями та зануритися у світ "
    "рольової гри.\n\n"
    "Якщо ти тут уперше — радимо спочатку "
    "дізнатися більше про нашу ролівку."
)


INFO_ARTICLES = {
    "info:rp": (
        "<b>🎭 Що таке текстова рольова?</b>\n\n"
        "Це гра для людей, які люблять писати, створювати та фантазувати. Кожен гравець веде самотужки написаного персонажа, чи персонажів, що значить писати пости (шматки тексту) від їх імені. Вести персонажа зовсім не означає ототожнювати себе з ним, адже думати про текстові ролівки варто радше як про спільно написану книгу, аніж як про повсякденне спілкування під вигаданими амплуа. Особистості гравця та персонажа невзаємозамінні та розділені навіть в чатах. Ріжце має окрему групу з постами та флуд для спілкування на довільні теми, чи обговорення подій гри."
    ),
    "info:about": (
        "<b>👹 Про Ріжце</b>\n\n"
        "Ріжце – крихітне, богом забуте село на Закарпатті. Хіба мало було таких у далекому 1908 році? Там вечорами в старенькій корчмі бринять келихи та захмелілий сміх селян, які полишили втому від роботи в полі десь за порогом; там на болоті та коло річки дзвінко кумкають жаби, не наполохані людською присутністю, а пасовисько та густі ліси шумлять муравою та пташиним клекотанням; там люди всі як один зичливі, аж доки подорожні не просунуться надто глибоко, намагаючись відкопати секрети, давно поховані в землі, такій родючій на таємниці. Лісова хаща погрожуватиме зімкнутися склепінням над головами шукачів пригод і наживи, а кумкання жаб може виявитися останнім, що вони почують у своєму житті./n/n"
        "Основний сюжет просувається івентами – значущими подіями, які охоплюють або кількох персонажів (персональні івенти), або глобально всіх охочих доєднатися (групові івенти). Події розгортаються навколо загадкового спадку покійного мецената – Кіндарная Андраша, чия смерть викликала неабиякий резонанс в медіа як усередині країни, так і за її межами. Згідно з його умовами, усі статки та активи померлого перейдуть до рук того приїжджого, який подужає знайти в межах Ріжця особливу колоду карт і доставить її довіреній особі Андраша – його нотаріусу, Яношу Біро. Та прості пошуки ризикують обернутися жахом, коли на кону стоїть дещо навіть більше, ніж омріяне багатство, а гострі, як леза, кігті тільки й чекають нагоди вп’ятися в чиєсь горло."
    ),
    "info:rules": (
        "<b>📜 Правила</b>\n\n"
        "о"
    ),
    "info:post": (
        "<b>🎮 Як проходить гра?</b>\n\n"
        "Тут згодом буде пояснення того, як "
        "проходить гра, як створити персонажа "
        "та як почати свою історію."
    ),
    "info:character": (
        "<b>🎮 Як проходить гра?</b>\n\n"
        "Тут згодом буде пояснення того, як "
        "проходить гра, як створити персонажа "
        "та як почати свою історію."
    )
}


@router.message(CommandStart())
async def start(message: Message) -> None:
    await message.answer(
        WELCOME_TEXT,
        reply_markup=main_menu(),
    )


@router.message(Command("menu"))
async def menu(message: Message) -> None:
    await message.answer(
        WELCOME_TEXT,
        reply_markup=main_menu(),
    )


@router.callback_query(F.data == "menu")
async def menu_callback(
    callback: CallbackQuery,
) -> None:
    await callback.answer()

    await callback.message.edit_text(
        WELCOME_TEXT,
        reply_markup=main_menu(),
    )


@router.callback_query(F.data == "info:menu")
async def info_menu_callback(
    callback: CallbackQuery,
) -> None:
    await callback.answer()

    await callback.message.edit_text(
        "<b>📖 Дізнатися більше</b>\n\n"
        "Обери тему, про яку хочеш дізнатися:",
        reply_markup=info_menu(),
    )


@router.callback_query(
    F.data.in_(
        {
            "info:rp",
            "info:world",
            "info:rules",
            "info:game",
        }
    )
)
async def info_article(
    callback: CallbackQuery,
) -> None:
    await callback.answer()

    text = INFO_ARTICLES.get(
        callback.data,
        "Статтю не знайдено.",
    )

    await callback.message.edit_text(
        text,
        reply_markup=back_keyboard(),
    )
